
Процедура ДобавитьОтборСКД(ИмяПоля, Настройки, ВидСравнения, ЗначениеОтбора) Экспорт
	
	ПолеОтбора					= Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборПоПолю 				= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПолю.ЛевоеЗначение   = ПолеОтбора;
	ОтборПоПолю.ВидСравнения    = ВидСравнения;
	ОтборПоПолю.ПравоеЗначение  = ЗначениеОтбора;
	ОтборПоПолю.Использование 	= Истина;
	
КонецПроцедуры


Процедура УстановитьПараметрСКД(ИмяПоля, Настройки, ВидСравнения, Значение) Экспорт
	
	ПолеПараметра = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПоля);
	ПолеПараметра.Значение = Значение;
	ПолеПараметра.Использование = Истина;
	
КонецПроцедуры


Процедура ВывестиВКоллекциюЗначений(Схема, Настройки, Колллекция) Экспорт
	
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,
	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , , Истина);
	ПроцессорВывода     = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Колллекция);
	
	ПроцессорВывода.НачатьВывод();
	Пока Истина Цикл
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		Иначе
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		КонецЕсли;
	КонецЦикла;	
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

Процедура УбартьПоследнииеНули(МассивДанных) Экспорт
	КоличествоЭлементов = МассивДанных.Количество();
	Для н = 1 по КоличествоЭлементов Цикл
		Итератор = КоличествоЭлементов - н;
		Если МассивДанных[Итератор] = 0 Тогда
			МассивДанных.Удалить(Итератор);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры