
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстыЗапросов.ЛобовойПрогноз();
	Запрос.УстановитьПараметр("Период", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("СглаженныеДанные", Ложь);

	РезультатЗапроса = Запрос.Выполнить();
	Объект.План.Очистить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтрока = Объект.План.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Сумма = Выборка.Цена * Выборка.Прогноз;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
